caseIfeelStrange/cyclic/twoPhaseEulerFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          1e-4;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  no;

maxCo           0.9;

maxDeltaT       1e-04;

functions
{
    
   volFieldValue1
   {
       type            volFieldValue;
       libs            ("libfieldFunctionObjects.so");

       log             true;
       writeControl    writeTime;
       
       writeFields     true;

       regionType      all;
       operation       volAverage;

       //weightField     alpha1;

       fields
       (
           alpha.particles   
           U.air
           U.particles  
           p
           p_rgh
       );
   }
}


// ************************************************************************* //
