caseIfeelStrange/cyclic/twoPhaseEulerFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0      0     0)
    (0.2   0     0)
    (0.2   0.00125  0)
    (0      0.00125  0)
    (0      0     0.5)
    (0.2   0    0.5)
    (0.2   0.00125  0.5)
    (0      0.00125  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 1 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
    	type cyclic;
        	neighbourPatch outlet;	
			faces
			(
			    (0 1 2 3)
			);
    }
    outlet
    {
    	type cyclic;
        	neighbourPatch inlet;	
			faces
			(
			    (4 5 6 7)
			);
    }
    walls
    {
    	type wall;
        		
			faces
			(
			   (1 2 6 5)
         (3 0 4 7)
			);
    }
    front_back
    {
    	type empty;
        		
			faces
			(
         (0 1 5 4)
         (2 3 7 6)
			);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
