caseIfeelStrange/cyclic/twoPhaseEulerFoam/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type      meanVelocityForce;

    timeStart       0.0;
    duration        1000;
    selectionMode   all;
    
    fields          (U.air);
    Ubar            (0 0 0.24);
    relaxation      1.0;
}


// ************************************************************************* //
