caseIfeelStrange/cyclic/twoPhaseEulerFoam/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.24);

boundaryField
{
    inlet
    {
        type           cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    walls
    {
        type            noSlip;
    }

    front_back
    {
        type            empty;
    }
}

// ************************************************************************* //
